app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-14 19:46:03.276599"], ["email", "asdlkjasdlfj"], ["updated_at", "2014-08-14 19:46:03.276599"]]
---
  def create
    @user = User.create(user_params)